src/InformationRegisters/бпсБизнесПроцессыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>бпсБизнесПроцессыСогласования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/бпсБизнесПроцессыСогласования/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Согласование,Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	Конецесли;
	ОбъектБД = Согласование.ОбъектБД;
	ПредметСогласования = Согласование.ПредметСогласования;
	Период = Согласование.Дата;
	
	НаборЗаписей = РегистрыСведений.бпсБизнесПроцессыСогласования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметСогласования.Установить(ПредметСогласования);
	НаборЗаписей.Отбор.ОбъектБД.Установить(ОбъектБД);
	НаборЗаписей.Отбор.Период.Установить(Период);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = Период;
	Запись.ПредметСогласования = ПредметСогласования;
	Запись.ОбъектБД = ОбъектБД;
	Запись.Согласование = Согласование;
	
	НаборЗаписей.Записать();
КонецПроцедуры //ДобавитьЗапись(Согласование)
